modm-ext/archive-stmicro-svd/html_rm0090_stm32f415ogy6.svd
        <register>
          <name>BGCLUT.201</name>
          <addressOffset>0xb24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.202</name>
          <addressOffset>0xb28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.203</name>
          <addressOffset>0xb2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.204</name>
          <addressOffset>0xb30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.205</name>
          <addressOffset>0xb34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.206</name>
          <addressOffset>0xb38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.207</name>
          <addressOffset>0xb3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.208</name>
          <addressOffset>0xb40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.209</name>
          <addressOffset>0xb44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.210</name>
          <addressOffset>0xb48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.211</name>
          <addressOffset>0xb4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.212</name>
          <addressOffset>0xb50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.213</name>
          <addressOffset>0xb54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.214</name>
          <addressOffset>0xb58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.215</name>
          <addressOffset>0xb5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.216</name>
          <addressOffset>0xb60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.217</name>
          <addressOffset>0xb64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.218</name>
          <addressOffset>0xb68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.219</name>
          <addressOffset>0xb6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.220</name>
          <addressOffset>0xb70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.221</name>
          <addressOffset>0xb74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.222</name>
          <addressOffset>0xb78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.223</name>
          <addressOffset>0xb7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.224</name>
          <addressOffset>0xb80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.225</name>
          <addressOffset>0xb84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.226</name>
          <addressOffset>0xb88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.227</name>
          <addressOffset>0xb8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.228</name>
          <addressOffset>0xb90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.229</name>
          <addressOffset>0xb94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.230</name>
          <addressOffset>0xb98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.231</name>
          <addressOffset>0xb9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.232</name>
          <addressOffset>0xba0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.233</name>
          <addressOffset>0xba4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.234</name>
          <addressOffset>0xba8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.235</name>
          <addressOffset>0xbac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.236</name>
          <addressOffset>0xbb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.237</name>
          <addressOffset>0xbb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.238</name>
          <addressOffset>0xbb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.239</name>
          <addressOffset>0xbbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.240</name>
          <addressOffset>0xbc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.241</name>
          <addressOffset>0xbc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.242</name>
          <addressOffset>0xbc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.243</name>
          <addressOffset>0xbcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.244</name>
          <addressOffset>0xbd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.245</name>
          <addressOffset>0xbd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.246</name>
          <addressOffset>0xbd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.247</name>
          <addressOffset>0xbdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.248</name>
          <addressOffset>0xbe0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.249</name>
          <addressOffset>0xbe4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.250</name>
          <addressOffset>0xbe8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.251</name>
          <addressOffset>0xbec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.252</name>
          <addressOffset>0xbf0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.253</name>
          <addressOffset>0xbf4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.254</name>
          <addressOffset>0xbf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>BGCLUT.255</name>
          <addressOffset>0xbfc</addressOffset>
          <size>0x20</size>
        </register>
